# Группы единиц измерения
UNIT_GROUPS = {
    "Температура": ["°C", "°F", "K"],
    "Длина": ["м", "км", "см"],
    "Масса": ["г", "кг", "т"]
}

# Формулы конвертации: ключ — (из, в), значение — функция
CONVERSION_FORMULAS = {
    # Температура
    ("°C", "°F"): lambda x: x * 9/5 + 32,
    ("°F", "°C"): lambda x: (x - 32) * 5/9,
    ("°C", "K"): lambda x: x + 273.15,
    ("K", "°C"): lambda x: x - 273.15,
    ("°F", "K"): lambda x: (x - 32) * 5/9 + 273.15,
    ("K", "°F"): lambda x: (x - 273.15) * 9/5 + 32,

    # Длина
    ("м", "км"): lambda x: x / 1000,
    ("км", "м"): lambda x: x * 1000,
    ("м", "см"): lambda x: x * 100,
    ("см", "м"): lambda x: x / 100,
    ("км", "см"): lambda x: x * 100000,
    ("см", "км"): lambda x: x / 100000,

    # Масса
    ("г", "кг"): lambda x: x / 1000,
    ("кг", "г"): lambda x: x * 1000,
    ("кг", "т"): lambda x: x / 1000,
    ("т", "кг"): lambda x: x * 1000,
    ("г", "т"): lambda x: x / 1000000,
    ("т", "г"): lambda x: x * 1000000,
}